app/Http/Controllers/AdminPageController.php

select * from `applications`
select * from `stores` where `created_at` between '2022-08-22 00:00:00' and '2022-08-28 23:59:59'
select * from `selected_subscriptions`
---
    public function dashboard(){
        $account_info = Application::all()->first();
        $store_count = Store::all()->count();
        $product_count = Product::all()->count();
        $earnings = SelectedSubscription::all()->where('payment_status','=','paid')->sum('subscription_price');
        $new_stores = Store::whereBetween('created_at', [Carbon::now()->startOfWeek(), Carbon::now()->endOfWeek()])->get();
        $pending_stores = 0;
        $transactions = SelectedSubscription::all()->sortByDesc('id')->take(4);

select * from `stores`
---
    public function all_stores(){


        $stores = Store::all();

select * from `applications`
select * from `settings` order by `id` asc
---
    public function settings(){
        $account_info = Application::all()->first();
//        $account_info = DB::table('applications')->first();
        $modules = Module::all()->where('category', 1);

        $settings = DB::table('settings')->orderBy('id')->get();
        $privacy =  DB::table('settings')->orderBy('id')->get();
        $whatsapp =  DB::table('settings')->orderBy('id')->get();
        $customcss =   DB::table('settings')->orderBy('id')->get();

select * from `translations`
---
    public function translations(){
        $data = Translation::all();

select * from `selected_subscriptions`
---
    public function transactions(){
        $transactions = SelectedSubscription::all();

select count(distinct `customer_phone`) as aggregate from `orders`
select distinct * from `orders` order by `id` desc limit 30 offset 0
---
    public function customers(){
        $customers = Order::orderBy('id','DESC')->distinct('customer_phone')->paginate(30);

select * from `testimonials`
---
    public function testimonials(){
        $testimonial = Testimonial::all()->sortByDesc('id');

select * from `expenses`
---
    public function expense(){


        $expenses = Expense::all();