app/Http/Controllers/RestaurantAdminPageController.php

    public function __construct(Redirector $redirect)
    {
        $this->middleware('auth:store');


        if(Route::currentRouteName()!='store_admin.subscription_plans' && (Setting::find(23)->value ?? 0) == 1){
---
select * from `settings` where `settings`.`id` = 23 limit 1

    public function index()
    {

        $store_id = Auth::user()->id;
        $translation = new TranslationService();
        $sanboxNumber = Setting::all()->where('key','PhoneCode')->first()->value;
        $order_count = Order::all()->where('store_id','=', $store_id )->count();
        $call_waiter_count = WaiterCall::all()->where('store_id','=', $store_id )->count();
        $item_sold = DB::table('orders')->where('store_id','=', $store_id )
            ->select('*')
            ->join('order_details','orders.id','=','order_details.order_id')
            ->where('orders.status','=',4)
            ->get()->sum('quantity');

        $earnings = Order::all()->where('status','=',4)->where('store_id','=', $store_id )->sum('total');
        $account_info = Application::all()->first();
        $orders = Order::orderBy('created_at','DESC')->where('store_id', auth()->id())->where('status','=',1)->limit(6)->get();
        $latestreviews = OrderRating::where('store_id', auth()->id())->orderBy('created_at','DESC')->limit(5)->get();
        $notification = $this->notification();

        return view('restaurants.index',[
            'root' =>'dashboard',
            "order_count"=>$order_count,
            'call_waiter_count'=>$call_waiter_count,
            "item_sold"=>$item_sold,
            "earnings"=> $earnings,
            "account_info" =>  $account_info,
            'orders'=>$orders,
            'notification'=>$notification,
            'sanboxNumber'=>$sanboxNumber,
            'root_name' => 'Dashboard',
            'ratings' => $latestreviews,
            'languages'=>$translation->languages(),
            'selected_language' => $translation->selected_language()
        ]);
---
select * from `orders` inner join `order_details` on `orders`.`id` = `order_details`.`order_id` where `store_id` = 1 and `orders`.`status` = 4
select * from `orders`
select * from `applications`
select * from `orders` where `store_id` = 1 and `status` = 1 order by `created_at` desc limit 6
select * from `order_ratings` where `store_id` = 1 order by `created_at` desc limit 5
select * from `settings`
select * from `waiter_calls`

    public function orders(){
        $account_info = Application::all()->first();
        $sanboxNumber = Setting::all()->where('key','PhoneCode')->first()->value;
        $translation = new TranslationService();
        $orders = Order::where('store_id', auth()->id())->orderby('id','desc')->paginate(15);
        $orders_count = Order::all()->SortByDesc('id')->where('store_id', auth()->id())->count();
        return view('restaurants.orders.orders',[
            'root' => 'orders',
            'orders'=>$orders,
            'orders_count'=>$orders_count,
            'root_name' => 'Orders',
            "account_info" =>  $account_info,
            'sanboxNumber'=>$sanboxNumber,
            'languages'=>$translation->languages(),
            'selected_language' => $translation->selected_language()

        ]);
---
select * from `applications`
select * from `orders` where `store_id` = 1 order by `id` desc limit 15 offset 0
select count(*) as aggregate from `orders` where `store_id` = 1
select * from `settings`
select * from `orders`

    public function orderstatus(){
        $translation = new TranslationService();
        $account_info = Application::all()->first();
        $sanboxNumber = Setting::all()->where('key','PhoneCode')->first()->value;
        $orders = Order::all()->SortByDesc('id')->where('store_id', auth()->id())->where('status','=',2);
        $neworder = Order::all()->SortByDesc('id')->where('store_id', auth()->id())->where('status','=',1);
        $ready = Order::all()->SortByDesc('id')->where('store_id', auth()->id())->where('status','=',5);
        return view('restaurants.orders.orderstatus',[
            'root'=>'order_status',
            'orders'=>$orders,
            'neworder'=>$neworder,
            'ready'=>$ready,
            'root_name' => 'Order Status Screen',
            "account_info" =>  $account_info,
            'sanboxNumber'=>$sanboxNumber,
            'languages'=>$translation->languages(),
            'selected_language' => $translation->selected_language()
        ]);
---
select * from `applications`
select * from `settings`
select * from `orders`

    public function order_delete(Request $request)
    {

        Order::destroy($request->id);

        return back()->with(Toastr::success('Order Deleted successfully ','Success'));
---
select * from `orders`